#### 关于 清华大学计算社会科学平台

为了提升清华计算社会科学研究的整体水平，营造“创新、共享、开放、合作”的大数据科研环境，打造大数据时代清华社会科学发展的独特品牌，2017年5月，清华大学社科学院决定联合清华其他社科类学院系、清华大学数据科学研究院建设“清华大学计算社会科学平台（Tsinghua-Computational Social Science Institution）”以服务于社科学院在“十三五”期间顺利实现“弯道超车”，建成国际一流社会科学的发展目标。

“清华大学计算社会科学平台”将充分利用清华大学、大数据产业界、相关政府部门的多样化资源条件，组织经济学、心理学、社会学、政治学、国际关系等多学科研究团队系统地开展将大数据资源、大数据方法和大数据方案应用于社会科学研究，为社会科学研究范式转换、促进重大经济社会问题解决提供理论和应用知识。

### 本节内容
#### pandas包的使用

In [18]:
## 向字典里添加元素：dict_name['new_element'] = 'new value'
dict_1['new_key'] = 'new value'
dict_1

NameError: name 'dict_1' is not defined

#### 基础数据处理

In [ ]:
import numpy as np
import pandas as pd
import random # 帮助你 generate 随机数

np.random.seed(3201) # 伪随机数 - 可复制性
pd_item = np.random.randn(6)
pd_item

array([ 1.26041421,  0.72542566,  0.69852883,  0.12310086, -0.64947929,
        0.2364085 ])

In [ ]:
# 把创建好的 item 放入数组 series 中

s = pd.Series(pd_item, index = ['a', 'b', 'c', 'd', 'e', 'f'], name = "this_is_my_name")

s

a    1.260414
b    0.725426
c    0.698529
d    0.123101
e   -0.649479
f    0.236409
Name: this_is_my_name, dtype: float64

In [ ]:
print(s.name) # print out the name of this series

this_is_my_name

In [ ]:
print('index 为 0对应的：', s[0])

print('index 为 a对应的：', s['a'])

index 为 0对应的： 1.260414210077518
index 为 a对应的： 1.260414210077518

In [ ]:
print(s['a'] == 2) # 在此注意赋值的 ’=‘ 和 等号 ’==‘

s['a'] = 2

print(s)

False
a    2.000000
b    0.725426
c    0.698529
d    0.123101
e   -0.649479
f    0.236409
Name: this_is_my_name, dtype: float64

In [ ]:
s + s # 对 series 进行运算

a    4.000000
b    1.450851
c    1.397058
d    0.246202
e   -1.298959
f    0.472817
Name: this_is_my_name, dtype: float64

In [ ]:
print(s * s)
print(s) # s 是否变化？

a    4.000000
b    0.526242
c    0.487943
d    0.015154
e    0.421823
f    0.055889
Name: this_is_my_name, dtype: float64
a    2.000000
b    0.725426
c    0.698529
d    0.123101
e   -0.649479
f    0.236409
Name: this_is_my_name, dtype: float64

#### about 'iloc' and 'loc'
#### - use iloc to index “index position”
#### - use loc to index labels

In [ ]:
print(s.iloc[:1], '\n')

# : = select all data across rows/columns.
# 0:3 will select row/column 0, 1 and 2, 3 excluded.

a    2.0
Name: this_is_my_name, dtype: float64

In [ ]:
print(s.iloc[1], '\n')

0.7254256611129096

In [ ]:
print(s.iloc[1:])

b    0.725426
c    0.698529
d    0.123101
e   -0.649479
f    0.236409
Name: this_is_my_name, dtype: float64

In [ ]:
# print(s.loc['a'])
# print(s.loc[1])

In [ ]:
# 从单一series 到 多个series

# {key: value}
d = {
    "one": pd.Series([1.0, 2.0, 1.5, 5.0], index = ['a', 'b', 'c', 'd']),
    "two": pd.Series([1.0, 2.0, 3.0, 4.0], index = ['a', 'b', 'c', 'd']),
}

In [ ]:
print(d)

{'one': a    1.0
b    2.0
c    1.5
d    5.0
dtype: float64, 'two': a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64}

In [ ]:
df = pd.DataFrame(d) # 把 series 转化为 dataframe

In [ ]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  1.5  3.0
d  5.0  4.0

In [ ]:
print(s)

a    2.000000
b    0.725426
c    0.698529
d    0.123101
e   -0.649479
f    0.236409
Name: this_is_my_name, dtype: float64

In [ ]:
df.index # row

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
df.columns # column

Index(['one', 'two'], dtype='object')

In [ ]:
# column排序
df.sort_values(by = 'one', ascending = False) # by = 'two'

   one  two
d  5.0  4.0
b  2.0  2.0
c  1.5  3.0
a  1.0  1.0

关于pandas包中的函数使用方法见 https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html

In [ ]:
# 按轴排序

df.sort_index(axis = 0, ascending = False) 

# axis = 0 是指沿着（along）第0个维度进行运算，纵向（axis = 0）, 横向（axis = 1）

   one  two
d  5.0  4.0
c  1.5  3.0
b  2.0  2.0
a  1.0  1.0

In [ ]:
# loc 用标签选择数据：

print(df.loc['a':'c', ['one']], '\n', type(df.loc[:, ['one']])) # 如果选择多列，要使用 ['one', 'two']

   one
a  1.0
b  2.0
c  1.5
 <class 'pandas.core.frame.DataFrame'>

In [ ]:
print(df.loc[:, 'one'])# 如果在这里改成‘one’， ‘two’ 会怎么样呢？

print('\n', type(df.loc[:, 'one'])) # 注意这个部分的 type

a    1.0
b    2.0
c    1.5
d    5.0
Name: one, dtype: float64

 <class 'pandas.core.series.Series'>

In [20]:
# how to read dataframe
# read data.frame


import os # looking for path


folder_for_data = os.getcwd() # see os.getcwd() current working directory

print(os.getcwd())

c:\Users\guil\Desktop\Python-Workshop-22fall\2 handout-1021\handout-1021

In [21]:
file_path = os.path.join(folder_for_data, 'ufo.csv') 

print(file_path)

# print(file_path) ## what do you see?

data = pd.read_csv(file_path, encoding = 'utf-8') # encoding: python要按照utf-8编码的方式来读取程序

data.head() # first five observations; and then try data.tail()

c:\Users\guil\Desktop\Python-Workshop-22fall\2 handout-1021\handout-1021\ufo.csv

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [40]:
# check data property
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18216 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  object
dtypes: object(5)
memory usage: 712.7+ KB

In [41]:
# how to select...
data['City'].head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [42]:
print(data.iloc[1]) # how many observations did you print?

# print(data.iloc[1:3])

City                   Willingboro
Colors Reported                NaN
Shape Reported               OTHER
State                           NJ
Time               6/30/1930 20:00
Name: 1, dtype: object

In [43]:
#### check if there are missing values in the table

data['City'].isna().any()

True

In [44]:
data.isna().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [45]:
# 如何了解哪些是missing？
result = data['City'].isnull().to_numpy().nonzero() 
print(result)

(array([   21,    22,   204,   241,   613,  1877,  2013,  2546,  3123,
        4736,  5269,  6735,  7208,  8828,  8967,  9273,  9388,  9587,
       10399, 11625, 12441, 15767, 15812, 16054, 16608]),)

In [46]:
print(data.iloc[:,0].head()) 
data.head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [47]:
data.iloc[:,1:3].head() # guess what do you have?

  Colors Reported Shape Reported
0             NaN       TRIANGLE
1             NaN          OTHER
2             NaN           OVAL
3             NaN           DISK
4             NaN          LIGHT

In [48]:
print(data.iloc[1:3])

          City Colors Reported Shape Reported State             Time
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [49]:
# select columns by variable name + check structure of your dataset

print(data[['City', 'State']].head(), '\n')

                   City State
0                Ithaca    NY
1           Willingboro    NJ
2               Holyoke    CO
3               Abilene    KS
4  New York Worlds Fair    NY

In [50]:
print(data[['City', 'State']].shape) # dimension

(18241, 2)

#### 时间 datetime

In [51]:
import datetime # import datetime 模块
from datetime import datetime

now = datetime.now()
print(now, type(now))

2022-10-21 16:49:14.337805 <class 'datetime.datetime'>

In [52]:
print(now.strftime('%a, %b %d, %Y %H:%M'), type(now.strftime('%a, %b %d, %Y %H:%M')))

Fri, Oct 21, 2022 16:49 <class 'str'>

In [53]:
print(data['Time'][1], type(data['Time'][1]))

6/30/1930 20:00 <class 'str'>

In [54]:
# 先将string 转化为 datetime
transformed = datetime.strptime(data['Time'][1], '%m/%d/%Y %H:%M')
print(transformed, type(transformed))

1930-06-30 20:00:00 <class 'datetime.datetime'>

In [55]:
transformed_new = transformed.strftime('%a, %b %d, %Y %H:%M')
print(transformed_new, type(transformed_new))

Mon, Jun 30, 1930 20:00 <class 'str'>

In [56]:
data['Time_new'] = data['Time'].apply(lambda apple: datetime.strptime(apple, "%m/%d/%Y %H:%M").strftime("%a, %b %d, %Y %H:%M"))

# p-parse; f-format

In [57]:
data.head()

,City,Colors Reported,Shape Reported,State,Time,Time_new
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Sun, Jun 01, 1930 22:00"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Mon, Jun 30, 1930 20:00"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Sun, Feb 15, 1931 14:00"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Mon, Jun 01, 1931 13:00"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"Tue, Apr 18, 1933 19:00"

#### 建立/删除新变量：

In [58]:
# examine the column names

data.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time',
       'Time_new'],
      dtype='object')

In [59]:
data['Location'] = data.City + ', ' + data.State # use ',' to join these two columns, 'Location' is the variable name you assign

data.head() # new variable added!

,City,Colors Reported,Shape Reported,State,Time,Time_new,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Sun, Jun 01, 1930 22:00","Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Mon, Jun 30, 1930 20:00","Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Sun, Feb 15, 1931 14:00","Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Mon, Jun 01, 1931 13:00","Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"Tue, Apr 18, 1933 19:00","New York Worlds Fair, NY"

In [60]:
# 根据一些自己设置的值进行选择
New_England = ['ME', 'VT', 'NH', 'MA', 'CT', 'RI']
data['State'].isin(New_England)

0        False
1        False
2        False
3        False
4        False
         ...
18236    False
18237    False
18238    False
18239    False
18240    False
Name: State, Length: 18241, dtype: bool

In [61]:
data[data['State'].isin(New_England)] # data[......]

,City,Colors Reported,Shape Reported,State,Time,Time_new,Location
30,South Kingstown,NaN,SPHERE,RI,7/1/1944 20:00,"Sat, Jul 01, 1944 20:00","South Kingstown, RI"
46,South Portland,NaN,OVAL,ME,7/1/1946 13:30,"Mon, Jul 01, 1946 13:30","South Portland, ME"
102,Los Angeles,NaN,CIRCLE,CT,6/4/1949 10:00,"Sat, Jun 04, 1949 10:00","Los Angeles, CT"
150,Thompsonville,NaN,DISK,CT,2/3/1951 22:00,"Sat, Feb 03, 1951 22:00","Thompsonville, CT"
211,Manville,NaN,SPHERE,RI,7/30/1952 15:00,"Wed, Jul 30, 1952 15:00","Manville, RI"
...,...,...,...,...,...,...,...
18197,Greenfiled,GREEN,FIREBALL,MA,12/26/2000 18:30,"Tue, Dec 26, 2000 18:30","Greenfiled, MA"
18198,Warren,NaN,FIREBALL,VT,12/26/2000 18:30,"Tue, Dec 26, 2000 18:30","Warren, VT"
18203,Saco,NaN,TRIANGLE,ME,12/27/2000 22:10,"Wed, Dec 27, 2000 22:10","Saco, ME"
18211,Holyoke,NaN,DIAMOND,MA,12/28/2000 18:00,"Thu, Dec 28, 2000 18:00","Holyoke, MA"
18221,Franklin,NaN,DISK,NH,12/29/2000 20:50,"Fri, Dec 29, 2000 20:50","Franklin, NH"

In [62]:
# how to remove column(variable) from the dataframe?


data['ready_to_be_dropped'] = 2 
data['ready_to_be_dropped_1'] = 1

data.head()

,City,Colors Reported,Shape Reported,State,Time,Time_new,Location,ready_to_be_dropped,ready_to_be_dropped_1
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Sun, Jun 01, 1930 22:00","Ithaca, NY",2,1
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Mon, Jun 30, 1930 20:00","Willingboro, NJ",2,1
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Sun, Feb 15, 1931 14:00","Holyoke, CO",2,1
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Mon, Jun 01, 1931 13:00","Abilene, KS",2,1
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"Tue, Apr 18, 1933 19:00","New York Worlds Fair, NY",2,1

In [63]:
data_drop_sample = data.drop(['ready_to_be_dropped','ready_to_be_dropped_1'], axis = 1, inplace = False)

# 注意上一行代码中的axis = 1, 是沿着行从左到右的方向进行，所以删除的是列（column）
# 详细说明见 https://numpy.org/doc/stable/glossary.html - 'along an axis' 部分


data_drop_sample.head()

,City,Colors Reported,Shape Reported,State,Time,Time_new,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Sun, Jun 01, 1930 22:00","Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Mon, Jun 30, 1930 20:00","Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Sun, Feb 15, 1931 14:00","Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Mon, Jun 01, 1931 13:00","Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"Tue, Apr 18, 1933 19:00","New York Worlds Fair, NY"

In [64]:
data.head()

,City,Colors Reported,Shape Reported,State,Time,Time_new,Location,ready_to_be_dropped,ready_to_be_dropped_1
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Sun, Jun 01, 1930 22:00","Ithaca, NY",2,1
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Mon, Jun 30, 1930 20:00","Willingboro, NJ",2,1
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Sun, Feb 15, 1931 14:00","Holyoke, CO",2,1
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Mon, Jun 01, 1931 13:00","Abilene, KS",2,1
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"Tue, Apr 18, 1933 19:00","New York Worlds Fair, NY",2,1

In [65]:
data.drop(['ready_to_be_dropped','ready_to_be_dropped_1'], axis = 1, inplace = True)
data.head()

,City,Colors Reported,Shape Reported,State,Time,Time_new,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Sun, Jun 01, 1930 22:00","Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Mon, Jun 30, 1930 20:00","Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Sun, Feb 15, 1931 14:00","Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Mon, Jun 01, 1931 13:00","Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"Tue, Apr 18, 1933 19:00","New York Worlds Fair, NY"

In [66]:
def randomlist(variable, seednum): 
    random.seed(seednum) 
    random_number_list = [] # make an empty list where you can place your numbers later.
    for name_it_as_you_like in range(0, len(data)): # you can change this 'name_it_as_you_like' to anything you want, let's say, GPA
        another_name = random.randint(90,100) # randint = give me some random interger
        random_number_list.append(another_name)
    data[variable] = random_number_list

randomlist('Score', 100084)
randomlist('awww', 2301)

data.head()

,City,Colors Reported,Shape Reported,State,Time,Time_new,Location,Score,awww
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Sun, Jun 01, 1930 22:00","Ithaca, NY",98,94
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Mon, Jun 30, 1930 20:00","Willingboro, NJ",93,93
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Sun, Feb 15, 1931 14:00","Holyoke, CO",93,97
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Mon, Jun 01, 1931 13:00","Abilene, KS",97,93
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"Tue, Apr 18, 1933 19:00","New York Worlds Fair, NY",100,93

In [67]:
data['State'].value_counts()

# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.value_counts.html

CA    2529
WA    1322
TX    1027
NY     914
FL     837
AZ     738
OH     667
IL     613
PA     598
MI     591
OR     534
MO     448
NJ     370
CO     367
WI     357
NC     356
IN     326
GA     325
MA     322
VA     299
TN     286
NV     284
MN     254
KY     244
NM     241
CT     225
MD     215
AR     206
UT     193
AL     193
OK     193
ME     181
KS     176
LA     174
SC     166
IA     162
MT     144
MS     139
WV     132
ID     130
NH     125
AK     116
NE     101
HI      85
WY      69
RI      67
SD      57
ND      51
VT      44
DE      43
Fl       4
Ca       1
Name: State, dtype: int64

In [68]:
data['State'].value_counts(normalize = True)[:10]

CA    0.138644
WA    0.072474
TX    0.056302
NY    0.050107
FL    0.045886
AZ    0.040458
OH    0.036566
IL    0.033606
PA    0.032783
MI    0.032400
Name: State, dtype: float64

In [69]:
# sort values by 'Score'
data.sort_values('Score', ascending = False).head() # sort values by variable score by ascending order, but this will not change the actual order of your data

,City,Colors Reported,Shape Reported,State,Time,Time_new,Location,Score,awww
9120,Princeton,ORANGE,NaN,WI,3/1/1996 0:00,"Fri, Mar 01, 1996 00:00","Princeton, WI",100,95
2384,Gainsville,NaN,SPHERE,GA,6/1/1973 18:00,"Fri, Jun 01, 1973 18:00","Gainsville, GA",100,100
2363,Oakcliff,RED GREEN,CIRCLE,TX,4/16/1973 16:00,"Mon, Apr 16, 1973 16:00","Oakcliff, TX",100,92
11057,Iola,NaN,FIREBALL,IL,12/15/1997 22:00,"Mon, Dec 15, 1997 22:00","Iola, IL",100,99
11054,Thief River Falls,GREEN,DISK,MN,12/15/1997 1:00,"Mon, Dec 15, 1997 01:00","Thief River Falls, MN",100,91

In [70]:
# select by condition: only show those with score == 93
data[data.Score == 93][:10]

,City,Colors Reported,Shape Reported,State,Time,Time_new,Location,Score,awww
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Mon, Jun 30, 1930 20:00","Willingboro, NJ",93,93
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Sun, Feb 15, 1931 14:00","Holyoke, CO",93,97
11,Waterloo,NaN,FIREBALL,AL,6/1/1939 20:00,"Thu, Jun 01, 1939 20:00","Waterloo, AL",93,98
13,Keokuk,NaN,OVAL,IA,7/7/1939 2:00,"Fri, Jul 07, 1939 02:00","Keokuk, IA",93,93
17,Hapeville,NaN,NaN,GA,6/1/1942 22:30,"Mon, Jun 01, 1942 22:30","Hapeville, GA",93,92
29,Ft. Duschene,NaN,DISK,UT,6/30/1944 10:00,"Fri, Jun 30, 1944 10:00","Ft. Duschene, UT",93,94
31,North Tampa,NaN,CYLINDER,FL,7/15/1944 13:00,"Sat, Jul 15, 1944 13:00","North Tampa, FL",93,93
40,Roswell,NaN,SPHERE,NM,12/15/1945 2:00,"Sat, Dec 15, 1945 02:00","Roswell, NM",93,99
41,New York City,NaN,DISK,NY,1/8/1946 2:00,"Tue, Jan 08, 1946 02:00","New York City, NY",93,100
47,Oak Lawn,NaN,FORMATION,IL,9/12/1946 0:00,"Thu, Sep 12, 1946 00:00","Oak Lawn, IL",93,93

In [71]:
data[data.Score >= 93].City.head() # select the city column for all observations that fit [data.Score >= 93]

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [72]:
# what if you need more conditions?

data[(data.Score >= 93) & (data.Score <= 95)] [:10]

# try data[(data.Score >= 93) | (data.Score <= 95)]

,City,Colors Reported,Shape Reported,State,Time,Time_new,Location,Score,awww
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Mon, Jun 30, 1930 20:00","Willingboro, NJ",93,93
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Sun, Feb 15, 1931 14:00","Holyoke, CO",93,97
8,Eklutna,NaN,CIGAR,AK,10/15/1936 17:00,"Thu, Oct 15, 1936 17:00","Eklutna, AK",95,98
11,Waterloo,NaN,FIREBALL,AL,6/1/1939 20:00,"Thu, Jun 01, 1939 20:00","Waterloo, AL",93,98
13,Keokuk,NaN,OVAL,IA,7/7/1939 2:00,"Fri, Jul 07, 1939 02:00","Keokuk, IA",93,93
17,Hapeville,NaN,NaN,GA,6/1/1942 22:30,"Mon, Jun 01, 1942 22:30","Hapeville, GA",93,92
19,Bering Sea,RED,OTHER,AK,4/30/1943 23:00,"Fri, Apr 30, 1943 23:00","Bering Sea, AK",95,98
20,Nebraska,NaN,DISK,NE,6/1/1943 15:00,"Tue, Jun 01, 1943 15:00","Nebraska, NE",94,98
27,Clovis,NaN,DISK,NM,4/2/1944 11:00,"Sun, Apr 02, 1944 11:00","Clovis, NM",94,91
29,Ft. Duschene,NaN,DISK,UT,6/30/1944 10:00,"Fri, Jun 30, 1944 10:00","Ft. Duschene, UT",93,94

In [73]:
# which is equivalent to?
data[data.Score.isin(range(93, 96))].head(10)

,City,Colors Reported,Shape Reported,State,Time,Time_new,Location,Score,awww
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Mon, Jun 30, 1930 20:00","Willingboro, NJ",93,93
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Sun, Feb 15, 1931 14:00","Holyoke, CO",93,97
8,Eklutna,NaN,CIGAR,AK,10/15/1936 17:00,"Thu, Oct 15, 1936 17:00","Eklutna, AK",95,98
11,Waterloo,NaN,FIREBALL,AL,6/1/1939 20:00,"Thu, Jun 01, 1939 20:00","Waterloo, AL",93,98
13,Keokuk,NaN,OVAL,IA,7/7/1939 2:00,"Fri, Jul 07, 1939 02:00","Keokuk, IA",93,93
17,Hapeville,NaN,NaN,GA,6/1/1942 22:30,"Mon, Jun 01, 1942 22:30","Hapeville, GA",93,92
19,Bering Sea,RED,OTHER,AK,4/30/1943 23:00,"Fri, Apr 30, 1943 23:00","Bering Sea, AK",95,98
20,Nebraska,NaN,DISK,NE,6/1/1943 15:00,"Tue, Jun 01, 1943 15:00","Nebraska, NE",94,98
27,Clovis,NaN,DISK,NM,4/2/1944 11:00,"Sun, Apr 02, 1944 11:00","Clovis, NM",94,91
29,Ft. Duschene,NaN,DISK,UT,6/30/1944 10:00,"Fri, Jun 30, 1944 10:00","Ft. Duschene, UT",93,94

In [74]:
# describe all of the numeric columns
data.describe() # this will only show descriptives of numeric columns

              Score          awww
count  18241.000000  18241.000000
mean      94.995834     94.989639
std        3.161061      3.160969
min       90.000000     90.000000
25%       92.000000     92.000000
50%       95.000000     95.000000
75%       98.000000     98.000000
max      100.000000    100.000000

In [75]:
# what if you want to describe all variables

data.describe(include = 'all') # try data.describe(include=['object'])

,City,Colors Reported,Shape Reported,State,Time,Time_new,Location,Score,awww
count,18216,2882,15597,18241,18241,18241,18216,18241.000000,18241.000000
unique,6476,27,27,52,16145,16145,8029,NaN,NaN
top,Seattle,RED,LIGHT,CA,11/16/1999 19:00,"Tue, Nov 16, 1999 19:00","Seattle, WA",NaN,NaN
freq,187,780,2803,2529,27,27,187,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,NaN,NaN,94.995834,94.989639
std,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3.161061,3.160969
min,NaN,NaN,NaN,NaN,NaN,NaN,NaN,90.000000,90.000000
25%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,92.000000,92.000000
50%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,95.000000,95.000000
75%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,98.000000,98.000000
max,NaN,NaN,NaN,NaN,NaN,NaN,NaN,100.000000,100.000000

In [76]:
# now we want to look at……

data.mean(axis = 0) # axis 0 = 沿着 column 进行运算

Score    94.995834
awww     94.989639
dtype: float64

In [77]:
data.mean(axis = 1).head() # 沿着 row 进行运算

0    96.0
1    93.0
2    95.0
3    95.0
4    96.5
dtype: float64

In [78]:
# 如何计算加州的平均值？
data[data.State == 'CA'][:10]

,City,Colors Reported,Shape Reported,State,Time,Time_new,Location,Score,awww
6,Crater Lake,NaN,CIRCLE,CA,6/15/1935 0:00,"Sat, Jun 15, 1935 00:00","Crater Lake, CA",97,96
10,Fontana,NaN,LIGHT,CA,8/15/1937 21:00,"Sun, Aug 15, 1937 21:00","Fontana, CA",100,90
15,Forest Home,NaN,CIRCLE,CA,7/2/1941 11:30,"Wed, Jul 02, 1941 11:30","Forest Home, CA",99,97
16,Los Angeles,NaN,NaN,CA,2/25/1942 0:00,"Wed, Feb 25, 1942 00:00","Los Angeles, CA",96,95
25,San Diego,NaN,CIGAR,CA,1/1/1944 12:00,"Sat, Jan 01, 1944 12:00","San Diego, CA",98,93
33,Salinas AFB,NaN,DISK,CA,6/1/1945 12:00,"Fri, Jun 01, 1945 12:00","Salinas AFB, CA",92,92
38,Huntington Beach,NaN,DISK,CA,8/8/1945 12:00,"Wed, Aug 08, 1945 12:00","Huntington Beach, CA",97,92
42,Merced,NaN,SPHERE,CA,2/1/1946 17:00,"Fri, Feb 01, 1946 17:00","Merced, CA",95,93
44,Blairsden,GREEN,SPHERE,CA,6/30/1946 19:00,"Sun, Jun 30, 1946 19:00","Blairsden, CA",100,98
52,San Deigo,NaN,TRIANGLE,CA,4/15/1947 23:00,"Tue, Apr 15, 1947 23:00","San Deigo, CA",98,96

In [79]:
# group_by
data[data.State == 'CA']['Score'].mean() # calculate score of california

95.02767892447608

In [80]:
data.groupby('State').Score.median() # calculate median for each group， 计算每个州的中位数

# data.groupby('State').Score.mean() # this help calculate the mean for each group

State
AK    95.0
AL    95.0
AR    96.0
AZ    95.0
CA    95.0
CO    95.0
CT    95.0
Ca    99.0
DE    95.0
FL    95.0
Fl    91.5
GA    95.0
HI    95.0
IA    95.0
ID    94.0
IL    95.0
IN    95.0
KS    95.0
KY    95.0
LA    95.0
MA    95.0
MD    95.0
ME    94.0
MI    95.0
MN    95.0
MO    95.0
MS    95.0
MT    95.5
NC    95.0
ND    95.0
NE    94.0
NH    95.0
NJ    95.0
NM    95.0
NV    94.0
NY    95.0
OH    95.0
OK    95.0
OR    95.0
PA    95.0
RI    94.0
SC    95.0
SD    96.0
TN    95.0
TX    95.0
UT    95.0
VA    95.0
VT    95.0
WA    95.0
WI    95.0
WV    95.0
WY    95.0
Name: Score, dtype: float64

In [81]:
data.groupby('State').Score.max().head()

State
AK    100
AL    100
AR    100
AZ    100
CA    100
Name: Score, dtype: int64

In [82]:
data.groupby('State').Score.agg(['count', 'mean', 'min', 'max']).head() # calculate properties

       count       mean  min  max
State
AK       116  95.267241   90  100
AL       193  95.160622   90  100
AR       206  95.364078   90  100
AZ       738  95.100271   90  100
CA      2529  95.027679   90  100

In [83]:
#### end

#### references:
1 introduction to data science for social and policy research - collecting and organizing data with R and Python
2 https://github.com/stoive/pythontutorial
3 pandas documentation see https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html#dsintro
4 Python 文本分析（机械工业出版社）
5 https://datagy.io/